# INavisworksExporter Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
INavisworksExporter Interface
Members See Also
---
The interface used to implement a Navisworks exporter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public interface INavisworksExporter : IExternalServer
```

Visual Basic
---
```text
Public Interface INavisworksExporter _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class INavisworksExporter : IExternalServer
```

# Remarks
Implement this interface and register an instance of the derived class with the Navisworks external service.
# See Also
INavisworksExporter Members
Autodesk.Revit.DB Namespace